#!/usr/bin/env node

const len = 33; //句子数
const rnd = Math.floor(Math.random() * len);
const txt = new Array(len);
txt[0] = "一旦堕入笑骂由人的尘世，威猛有力的羽翼却寸步难行";
txt[1] = "隐约雷鸣 阴霾天空 但盼风雨来 能留你在此 隐约雷鸣 阴霾天空 即使天无雨 我亦留此地";
txt[2] = "我们所活着的人生是真实的，那可是毫无谎言的人生啊，大家都在努力的活着啊，那是被刻在灵魂上的记忆，是用尽力量活下去的记忆啊。";
txt[3] = "当一个人不能拥有的时候，他唯一能做的便是不要忘记.";
txt[4] = "不懂得使自己的孤独为众人接受的人，也不懂得在碌碌众生中自立。";
txt[5] = "赌上生命为你所拥有";
txt[6] = "我的诗歌，只为你灵魂的黑夜而作，一经被人窥破，便要苍白失色。";
txt[7] = "不管是怎样的回忆，都是我们活过的人生。";
txt[8] = "世界就像个巨大的马戏团，它让你兴奋，却让我惶恐，因为我知道散场永远是：有限温存，无限辛酸。";
txt[9] = "白昼之光，岂知夜色之深";
txt[10] = "活得语焉不详，死得不明不白";
txt[11] = "死亡是一种幸福，是非常深邃的幸福···是在痛苦不堪的徘徊后踏上归途，是严重错误的纠正，是从难以忍受的枷锁桎梏中得到解放。";
txt[12] = "生命只是一连串孤立的片刻，靠着回忆和幻想，许多意义浮现了，然后消失，消失之后又浮现。";
txt[13] = "梦的碎片从我手里滑落，为了寻找失去的答案，我开始奔跑";
txt[14] = "这世上没有奇迹,有的是偶然和必然,还有人的所作所为";
txt[15] = "祝你能和重要的人，有一天能够再次相遇。";
txt[16] = "我终将遗忘梦境中的那些路径、山峦与田野，遗忘那些永远不能实现的梦。";
txt[17] = "远远看去优美而神秘的人和事，只要拉近了看，就会明白它们原来既不神秘又不优美。";
txt[18] = "我现在才明白，凡属严重错误都有一个共同的性质：那就是没有克制感情的冲动。";
txt[19] = "即使梦碎，你仍是我不染纤尘的渴望";
txt[20] = "惟一幸福的岁月是失去的岁月，惟一真实的乐园是失去的乐园。";
txt[21] = "厌倦和巨大的悲伤后面，充塞着雾霭沉沉的生存。";
txt[22] = "今天的风儿有点喧嚣";
txt[23] = "正因为生来什么都没有，因此我们能拥有一切。";
txt[24] = "人生如梦亦如歌，就如那是似水的年华般稍纵即逝，没有一点留恋…";
txt[25] = "我们冷静地在生活中进行这种对照，恰恰就是因为，我们目前的现状就是冷漠和遗忘";
txt[26] = "人们一辈子都在撒谎，甚至对爱自己的人，尤其对爱自己的人，也许仅仅对爱自己的人撒谎。";
txt[27] = "生活的目的不是真理，而是温情。";
txt[28] = "当岁月流逝，所有的东西都消失殆尽的时候，唯有空中飘荡的气味还恋恋不散，让往事历历在目。";
txt[29] = "尽管我们知道再无任何希望，我们仍然期待。等待稍稍一点动静，稍稍一点声响。";
txt[30] = "也许你我终将行踪不明，但是你该知道我曾因你动情";
txt[31] = "人们要是没有回忆就活不下去，但是只有回忆的话也活不下去；梦总是会有醒来的时候，不会醒的梦总有一天会变成悲伤。";
txt[32] = "他流动的不是血液，而是忘川的绿水。";
txt[33] = "温柔正确的人总是难以生存，因为这世界既不温柔，也不正确";

if (process?.argv[2]) {
  process.argv.splice(0, 2);
  process.argv.forEach((item) => {
    console.log(item);
  });
} else {
  console.log(txt[rnd]);
}
export const randomTxt = (input) => console.log(input ? input : txt[rnd]);
